In [7]:
import pandas as pd 
import sqlite3

In [16]:
# Lea el conjunto de datos elegido.
df = pd.read_csv('productos_vendidos.csv')

In [17]:
df.head(5)

  product_id  quantity        date store_id  unit_price customer_id
0       P001        10  2024-01-05     S001        20.5        C001
1       P002         5  2024-01-05     S002        15.0        C002
2       P003         8  2024-01-06     S001        18.0        C003
3       P001         7  2024-01-07     S003        20.5        C004
4       P004        15  2024-01-07     S002        25.0        C005

# SQL

In [18]:
# Crear DB en memoria
conn = sqlite3.connect(':memory:')
df.to_sql('Productos', conn, index=False, if_exists='replace')

32

In [ ]:
# Ejecutar la consulta
query = """
SELECT product_id, SUM(quantity) AS total_vendido
FROM Productos
GROUP BY product_id
ORDER BY total_vendido DESC
LIMIT 5;
"""

In [20]:
result = pd.read_sql_query(query, conn)
print(result)

  product_id  total_vendido
0       P004             51
1       P006             36
2       P001             35
3       P003             32
4       P002             29

In [27]:
# Ejecutar la consulta
query = """
SELECT product_id, SUM(quantity) AS total_vendido, unit_price
FROM Productos
GROUP BY product_id
ORDER BY total_vendido DESC
LIMIT 5;
"""
result = pd.read_sql_query(query, conn)
result

  product_id  total_vendido  unit_price
0       P004             51        25.0
1       P006             36        30.0
2       P001             35        20.5
3       P003             32        18.0
4       P002             29        15.0

# python + pandas

In [28]:
import pandas as pd

# Supongamos que ya tienes el DataFrame cargado:
# df = pd.read_csv("sales_extended.csv")
# o que se llama igual que la tabla:
# df = Productos

df = df  # adapta esto al nombre real de tu DataFrame

result = (
    df.groupby('product_id', as_index=False)
      .agg(
          total_vendido=('quantity', 'sum'),
          unit_price=('unit_price', 'first')  # asumimos que el precio es el mismo por producto
      )
      .sort_values('total_vendido', ascending=False)
      .head(5)
)

result

  product_id  total_vendido  unit_price
3       P004             51        25.0
5       P006             36        30.0
0       P001             35        20.5
2       P003             32        18.0
1       P002             29        15.0